int A[5]; /* 배열의 첫번째 원소를 가리키는 포인터*/
int A[5] = { 10, 20, 30, 40, 50 };
/*A[0]	10
  A[1]	20
  A[2]	30
  A[3]	40
  A[4]	50*/

int *p;
p = A;         /*A는 자동으로 &A[0]로 변한다 , p[2] == A[2]==30*/

void func(int* p); /*1차원 배열*/
void func(int p[]);/*둘다 똑같은 뜻이며 int를 여러개 가리키는 포인터 하나받기*/
int A[5];
func(A);   

int A[3][4]; /*2차원 배열,  int 4개짜리 3줄*/
/*A[0]	[0][1][2][3] (4칸)
  A[1]	[0][1][2][3] (4칸)
  A[2]	[0][1][2][3] (4칸)*/

int (*p)[4];  /*p는 포인터, [4]는 정수4개짜리 배열, int */

int A[3][4];

void func(int (*p)[4]) {
    p[1][2] = 10;   /*포인터 형식*/
}

void func(int p[3][4]) {
    p[1][2] = 10;   /*배열 형식*/
}

/*3차원 배열*/
int A[2][3][4];

void func(int (*p)[3][4]) {
    p[1][2][3] = 100;  /*포인터 형식*/
}

void func(int p[2][3][4]) {
    p[1][2][3] = 100;  /*배열 형식*/
}

/*1차원*/
int A[5];
int* p = A;     

void f(int* p); 
f(A);

/*2차원*/
int A[3][4];
int (*p)[4] = A;  

void f(int (*p)[4]);
void g(int p[][4]);
void h(int p[3][4]);

/*3차원*/
int A[2][3][4];
int (*p)[3][4] = A;

void f(int (*p)[3][4]);
void g(int p[][3][4]);
void h(int p[2][3][4]);

/*핵심*/
//1차원: int A[N]; → int*

//2차원: int A[R][C]; → int (*)[C]

//3차원: int A[X][Y][Z]; → int (*)[Y][Z]
